export const countries = {
  // 常用国家/地区
  CN: '中国',
  US: '美国',
  JP: '日本',
  KR: '韩国',
  DE: '德国',
  GB: '英国',
  FR: '法国',
  CA: '加拿大',
  AU: '澳大利亚',
  RU: '俄罗斯',
  BR: '巴西',
  TW: '台湾',
  HK: '香港',
  SG: '新加坡',
  TH: '泰国',
  MY: '马来西亚',
  ID: '印度尼西亚',
  PH: '菲律宾',
  VN: '越南',
  IN: '印度',
  
  // 欧洲国家
  IT: '意大利',
  ES: '西班牙',
  NL: '荷兰',
  PL: '波兰',
  SE: '瑞典',
  NO: '挪威',
  FI: '芬兰',
  DK: '丹麦',
  BE: '比利时',
  AT: '奥地利',
  CH: '瑞士',
  CZ: '捷克',
  PT: '葡萄牙',
  GR: '希腊',
  TR: '土耳其',
  UA: '乌克兰',
  RO: '罗马尼亚',
  HU: '匈牙利',
  
  // 美洲国家
  MX: '墨西哥',
  AR: '阿根廷',
  CL: '智利',
  CO: '哥伦比亚',
  PE: '秘鲁',
  
  // 亚洲国家
  AE: '阿联酋',
  SA: '沙特阿拉伾',
  IL: '以色列',
  
  // 大洋洲
  NZ: '新西兰',
  
  // 非洲
  ZA: '南非',
  EG: '埃及',
  
  // 其他
  MO: '澳门',
} as const;

